app/controllers/member_controller.rb

SELECT "members".* FROM "members"
---
    def index
        members = Member.all