app/controllers/messages_controller.rb

INSERT INTO "messages" ("room_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["room_id", 3], ["user_id", 1], ["content", "hi everyone!"], ["created_at", "2020-09-14 20:09:59.286350"], ["updated_at", "2020-09-14 20:09:59.286350"]]
---
    def create
        @message = Message.create user: current_user, room: @room, content: params.dig(:message, :content)

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def load_entities
        @room = Room.find params.dig(:message, :room_id)