app/controllers/project_technology_controller.rb

    def index
        project_technologies = ProjectTechnology.all
---
SELECT "project_technologies".* FROM "project_technologies"
SELECT "technologies".* FROM "technologies"