app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
    def index
        projects = Project.all

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Delta"], ["description", "hey cool!"], ["created_at", "2020-09-14 20:23:27.478932"], ["updated_at", "2020-09-14 20:23:27.478932"]]
INSERT INTO "members" ("user_id", "project_id", "is_owner", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["project_id", 10], ["is_owner", true], ["created_at", "2020-09-14 20:23:27.525556"], ["updated_at", "2020-09-14 20:23:27.525556"]]
SELECT "project_technologies".* FROM "project_technologies"
INSERT INTO "project_technologies" ("project_id", "technology_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 10], ["technology_id", 2], ["created_at", "2020-09-14 20:23:27.531288"], ["updated_at", "2020-09-14 20:23:27.531288"]]
---
    def create
        project = Project.create(project_params["project"])
        if project.valid?
            Member.create(user_id: current_user.id, project_id: project.id, is_owner: true)
            project_params["projectTechnologies"].each do |attribute|
                ProjectTechnology.create(project_id: project.id, technology_id: attribute)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 5]]
---
    def destroy
        project = Project.find(params[:id])
        project.destroy