app/controllers/rooms_controller.rb

    def create
         @room = Room.new permitted_parameters
        if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Delta Class!! "], ["created_at", "2020-09-14 20:09:50.236620"], ["updated_at", "2020-09-14 20:09:50.236620"]]

    def show
        @message = Message.new room: @room
        @messages = @room.messages.includes(:user)
---
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1  [["room_id", 2]]

    def load_entities
        @rooms = Room.all
        @room = Room.find(params[:id]) if params[:id]
---
SELECT "rooms".* FROM "rooms"
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]