app/controllers/technologies_controller.rb

SELECT "technologies".* FROM "technologies"
---
    def index
        technologies = Technology.all